app/views/people/show.html.erb

  <ul>
    <% @person.positions.each do |p| %>
---
SELECT "positions".* FROM "positions" WHERE "positions"."person_id" = ?  [["person_id", 82]]