app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
  def index
    @cities = City.all.sort_by{ |city| city.people.length }.reverse

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 58], ["LIMIT", 1]]
---
  def show
    @city = City.find(params[:id])

INSERT INTO "cities" ("name", "region", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Yelverton"], ["region", "Devon"], ["country", "United Kingdom"], ["created_at", "2019-03-25 22:23:45.303637"], ["updated_at", "2019-03-25 22:23:45.303637"]]
---
  def create
    @city = City.new(city_params)
      if @city.save

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 74], ["LIMIT", 1]]
---
  def edit
    @city = City.find(params[:id])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 105], ["LIMIT", 1]]
UPDATE "cities" SET "region" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["region", "Cheshire"], ["updated_at", "2019-03-25 22:24:22.868242"], ["id", 105]]
---
  def update
    @city = City.find(params[:id])
    @city.update_attributes(city_params)

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 108], ["LIMIT", 1]]
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 108]]
---
  def destroy
    @city = City.find(params[:id])
    @city.destroy