app/controllers/employers_controller.rb

SELECT "employers".* FROM "employers"
---
  def index
    @employers = Employer.all

SELECT  "employers".* FROM "employers" WHERE "employers"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
---
  def show
    @employer = Employer.find(params[:id])

INSERT INTO "employers" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-03-25 22:34:34.334143"], ["updated_at", "2019-03-25 22:34:34.334143"]]
---
  def create
    @employer = Employer.new(employer_params)
      if @employer.save

SELECT  "employers".* FROM "employers" WHERE "employers"."id" = ? LIMIT ?  [["id", 51], ["LIMIT", 1]]
---
  def edit
    @employer = Employer.find(params[:id])

SELECT  "employers".* FROM "employers" WHERE "employers"."id" = ? LIMIT ?  [["id", 51], ["LIMIT", 1]]
UPDATE "employers" SET "name" = ?, "updated_at" = ? WHERE "employers"."id" = ?  [["name", "Malvern"], ["updated_at", "2019-03-26 13:53:54.243503"], ["id", 3]]
---
  def update
    @employer = Employer.find(params[:id])
    @employer.update_attributes(employer_params)

SELECT  "employers".* FROM "employers" WHERE "employers"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]
DELETE FROM "employers" WHERE "employers"."id" = ?  [["id", 52]]
---
  def destroy
    @employer = Employer.find(params[:id])
    @employer.destroy