app/controllers/events_controller.rb

  def index
    @events = Event.all.sort_by{ |event| event.start_date }
---
SELECT "events".* FROM "events"

  def new
     @event = Event.new
     @cities = City.all
---
SELECT "cities".* FROM "cities"