app/controllers/positions_controller.rb

  def index
    @positions = Position.all
---
SELECT "positions".* FROM "positions"

  def show
      @position = Position.find(params[:id])
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
      @position = Position.new
      @employers = Employer.all
      @cities = City.all
---
SELECT "employers".* FROM "employers"
SELECT "cities".* FROM "cities"

  def create
      @position = Position.new
      p_info = position_params(:title,:person,:employer,:city,"start_date(1i)","start_date(2i)","start_date(3i)","finish_date(1i)","finish_date(2i)","finish_date(3i)")
      @position.start_date = Date.new(p_info["start_date(1i)"].to_i,p_info["start_date(2i)"].to_i,p_info["start_date(3i)"].to_i)
      @position.finish_date = Date.new(p_info["finish_date(1i)"].to_i,p_info["finish_date(2i)"].to_i,p_info["finish_date(3i)"].to_i)
      @position.update_attributes(title: p_info[:title], person: p_info[:person], employer: p_info[:employer], city: p_info[:city])
      if @position.save
---
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "MalvernUK"], ["created_at", "2019-03-26 20:27:48.641459"], ["updated_at", "2019-03-26 20:27:48.641459"]]
INSERT INTO "employers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Malvern"], ["created_at", "2019-03-26 20:27:48.644038"], ["updated_at", "2019-03-26 20:27:48.644038"]]
INSERT INTO "positions" ("title", "start_date", "finish_date", "person_id", "employer_id", "city_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @position = Position.find(params[:id])
    @employers = Employer.all
    @cities = City.all
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "employers".* FROM "employers"
SELECT "cities".* FROM "cities"

  def update
    @position = Position.find(params[:id])
    if @position.update(position_params)
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT ?  [["id", 100], ["LIMIT", 1]]
UPDATE "positions" SET "person_id" = ?, "updated_at" = ? WHERE "positions"."id" = ?  [["person_id", 52], ["updated_at", "2019-03-27 15:56:27.220611"], ["id", 104]]

  def destroy
    @position = Position.find(params[:id])
    @position.destroy
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT ?  [["id", 102], ["LIMIT", 1]]
DELETE FROM "positions" WHERE "positions"."id" = ?  [["id", 102]]