app/models/position.rb

  def employer=(name)
    self.employer_id = Employer.find_or_create_by(name: name).id
---
INSERT INTO "employers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "xfmfxmfxgm"], ["created_at", "2019-03-26 17:20:04.576181"], ["updated_at", "2019-03-26 17:20:04.576181"]]
SELECT  "employers".* FROM "employers" WHERE "employers"."name" = ? LIMIT ?  [["name", "Kassulke, Crist and Mante"], ["LIMIT", 1]]

  def city=(name)
    self.city_id = City.find_or_create_by(name: name).id
---
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "vhj,vhj,bh,"], ["created_at", "2019-03-26 17:20:04.582922"], ["updated_at", "2019-03-26 17:20:04.582922"]]
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = ? LIMIT ?  [["name", "Lorenafurt"], ["LIMIT", 1]]